artillery/test.yml
config:
  target: 'https://jsonplaceholder.typicode.com'
  phases:
    - duration: 60
      arrivalRate: 5
  payload:
    path: './posts.csv'
    fields:
      - userId
      - title
      - body
  defaults:
    headers:
      content-type: 'application/json'

scenarios:
  - flow:
      - get:
          url: '/posts'
      - post:
          url: '/posts'
          json:
            userId: '{{ userId }}'
            title: '{{ title }}'
            body: '{{ body }}'
      - get:
          url: '/posts/1'

ensure:
  - p95:
      response_time:
        max: 500
  - max:
      errors:
        count: 0
  - min:
      rps:
        count: 10